README.tex
% Created 2022-04-14 Do 23:13
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper, 11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lmodern} % Ensures we have the right font
\usepackage[T1]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage{graphicx, breqn}
\usepackage{mathtools, amsthm, amssymb, breqn}
\usepackage[table, xcdraw]{xcolor}
\definecolor{bblue}{HTML}{0645AD}
\usepackage[colorlinks]{hyperref}
\hypersetup{colorlinks, linkcolor=blue, urlcolor=bblue}
\usepackage{titling}
\setlength{\droptitle}{-6em}
\setlength{\parindent}{0pt}
\setlength{\parskip}{1em}
\usepackage[stretch=10]{microtype}
\usepackage{hyphenat}
\usepackage{ragged2e}
\usepackage{subfig} % Subfigures (not needed in Org I think)
\usepackage{hyperref} % Links
\usepackage{listings} % Code highlighting
\usepackage{pgfplots} % Plotting graphs
\usepackage[top=1in, bottom=1.25in, left=1.55in, right=1.55in]{geometry}
\renewcommand{\baselinestretch}{1.15}
\usepackage[explicit]{titlesec}
\pretitle{\begin{center}\fontsize{20pt}{20pt}\selectfont}
\posttitle{\par\end{center}}
\preauthor{\begin{center}\vspace{-6bp}\fontsize{14pt}{14pt}\selectfont}
\postauthor{\par\end{center}\vspace{-25bp}}
\predate{\begin{center}\fontsize{12pt}{12pt}\selectfont}
\postdate{\par\end{center}\vspace{0em}}
\titlespacing\section{0pt}{5pt}{5pt} % left margin, space before section header, space after section header
\titlespacing\subsection{0pt}{5pt}{-2pt} % left margin, space before subsection header, space after subsection header
\titlespacing\subsubsection{0pt}{5pt}{-2pt} % left margin, space before subsection header, space after subsection header
\usepackage{enumitem}
\setlist{itemsep=-2pt} % or \setlist{noitemsep} to leave space around whole list
\usepackage {mathtools , amssymb , amsthm}
\author{Fred Mitchell}
\date{\today}
\title{Slit Scan -- Generate an effect similar to 2001's star gate sequences}
\hypersetup{
 pdfauthor={Fred Mitchell},
 pdftitle={Slit Scan -- Generate an effect similar to 2001's star gate sequences},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.1.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{slit-scan}
\label{sec:org4fc88cb}
\subsection{Created By}
\label{sec:org4cf805a}
Fred Mitchell
\subsection{Introduction}
\label{sec:org5ed55df}
Slit-Scan is the command-line tool that allow you to create slit-scans similar to
the star-gate sequences in 2001: A Space Odyssey. The idea here is to add a lot of flexibility
to allow you to acheive results even beyond what was acheived in what is arguably the greatest
Science Fiction film of all time.
\subsection{Mathematics}
\label{sec:org6dd5691}
Here, we fully specify the mathematics involved with the slit-scan function.
Firstly, we define the slit function as a function between 2 points.

\item $t$ is time, in seconds, and
\item $p_1, p_2$
are points defining tbe beginning and ending of the slit, and
\item $$
 f(p_1, p_2, \rho) = g(p_1, p_2, slit(\rho)) \Bigr| _{\rho=0} ^{\rho=1}
$$
where \(line(\rho)\) defines the shape of the slit. For the traditional case,
\(line(\rho)\) will be \(0\), defining a straight line from \(p_1\) to \(p_2\).

\(\rho\) is the parametic for the slit.

Secondly, we define the movement of the slit across an image in terms of time \(t\):
$$
\begin{array}{l}
    p_1{_t} = p_1(t)\\
    p_2{_t} = p_2(t)
\end{array}
$$

Thirdly, we define the compositor function:

\begin{tikzpicture}
  \begin{axis} [grid, axis lines=center]
  \addplot [domain=-3:3, thick, smooth] { x^3 - 6*x };
  \end{axis}
\end{tikzpicture}

$$
 \frac{f(x)-f(a) x-a}g
$$
\end{document}